## Staging: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                  NAME                  |
|--------|----------------------------------------|
| update | `aws_iam_policy.idp_send_email`        |
| add    | `aws_route53_record.idp_dkim_CNAME[0]` |
|        | `aws_route53_record.idp_dkim_CNAME[1]` |
|        | `aws_route53_record.idp_dkim_CNAME[2]` |
|        | `aws_route53_record.idp_dmarc_TXT`     |
|        | `aws_route53_record.idp_spf_TXT`       |
|        | `aws_ses_domain_dkim.idp`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.idp_send_email will be updated in-place
  ~ resource "aws_iam_policy" "idp_send_email" {
        id        = "arn:aws:iam::687401027353:policy/idp_send_email"
        name      = "idp_send_email"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:ses:ca-central-1:687401027353:identity/auth.forms-staging.cdssandbox.xyz",
                          - "arn:aws:ses:ca-central-1:687401027353:identity/patrick.heard@cds-snc.ca",
                        ] -> "arn:aws:ses:ca-central-1:687401027353:identity/auth.forms-staging.cdssandbox.xyz"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.idp_dkim_CNAME[0] will be created
  + resource "aws_route53_record" "idp_dkim_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z05990652HOQ0SGHD81ZC"
    }

  # aws_route53_record.idp_dkim_CNAME[1] will be created
  + resource "aws_route53_record" "idp_dkim_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z05990652HOQ0SGHD81ZC"
    }

  # aws_route53_record.idp_dkim_CNAME[2] will be created
  + resource "aws_route53_record" "idp_dkim_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z05990652HOQ0SGHD81ZC"
    }

  # aws_route53_record.idp_dmarc_TXT will be created
  + resource "aws_route53_record" "idp_dmarc_TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc.auth.forms-staging.cdssandbox.xyz"
      + records         = [
          + "v=DMARC1; p=reject; sp=reject; pct=100; rua=mailto:security@cds-snc.ca",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z05990652HOQ0SGHD81ZC"
    }

  # aws_route53_record.idp_spf_TXT will be created
  + resource "aws_route53_record" "idp_spf_TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "auth.forms-staging.cdssandbox.xyz"
      + records         = [
          + "v=spf1 include:amazonses.com -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z05990652HOQ0SGHD81ZC"
    }

  # aws_ses_domain_dkim.idp will be created
  + resource "aws_ses_domain_dkim" "idp" {
      + dkim_tokens = (known after apply)
      + domain      = "auth.forms-staging.cdssandbox.xyz"
      + id          = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.idp"]

22 tests, 19 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
